{"inkVersion":21,"root":[[{"->":"thePremiseYouAre"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"blankStitch":[{"->":"thePremiseYouAre"},{"#f":1}],"thePremiseYouAre":[["#","^bg_tavern","/#","#","^pageNum: 1","/#","^The premise... You are an orphan raised by the Hearth family. They own a tavern called 'The Hearth', it is quite famous even among nobles. The family trained you to become a cook and help them with their business. You travel with Inky the slime, an expressive  black blob with two dots for eyes. You found Inky in an alleyway before being adopted by the Hearth family, you are practically siblings. You end up tied to Drachenfel and Rosaline, with possible routes toward Torvarn and Princess Layla, plus cults, guilds, and culinary duels.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"lisaHumsAtTheSto"},{"#f":5}]}],{"#f":1}],"lisaHumsAtTheSto":[["#","^pageNum: 2","/#","#","^bg_tavern","/#","^Lisa hums at the stove, the same tune she has hummed since you were a half starved stray sleeping by her back door. Garreck is butchering a side of venison, knife flashing with easy confidence. Maria dances between tables with plates balanced on her arms and flour still dusted on her cheeks. You stand at the end of the counter with your knife satchel packed, apron folded, and Inky perched on your shoulder like a sleepy, jiggling hat. Her glossy black body reflects the lantern light, eyes squinted into relaxed lines. Tonight is your last night at the Hearth. After this, the world. Lisa sets a bowl of stew in front of you and wipes her hands on her apron. “Eat, then decide,” she says. “You cannot cook on an empty belly. So. Are you really going to leave us and chase nobles and monsters, little chef” Garreck snorts. “If they are leaving, it should at least be for something worthy. Not for some tavern job down the road.” Maria leans close and taps the two letters on the counter. One bears a crimson dragon crest from Drachenfel. The other is stamped with a golden ship wheel from Velastra. Inky tilts toward the letters and gives a thoughtful squeak.","\n","ev","str","^Pick up the Drachenfel letter and read it again","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Pick up the Velastra letter instead","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Ignore both letters and tell them you want to stay","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"youPickUpTheLett"},{"#f":5}],"c-1":["\n",{"->":"toTheRenownedHea"},{"#f":5}],"c-2":["\n",{"->":"areYouSure"},{"#f":5}]}],{"#f":1}],"youPickUpTheLett":["^You pick up the letter with the crimson dragon crest. The wax is heavy and clean, pressed with the authority of a great house. You have already read the message a dozen times, but your eyes trace the words again.","\n",{"->":"toTheChefOfTheHe"},{"#f":1}],"toTheChefOfTheHe":[["^To the chef of the Hearth I, Lady Rosaline von Drachenfel, request your service as my personal chef and companion upon the frontier. I will provide travel, pay, and protection. In return, you will provide meals worthy of Drachenfel, in the field and at my table. If you accept, come to Drachenhold within the next month. Rosaline von Drachenfel","\n","ev","str","^Accept lady Rosaline's offer and prepare to leave for Drachenfel","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Hesitate and ask Lisa what she truly thinks","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Change your mind and look at the Velastra letter instead","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"inTheEndTheChoic"},{"#f":5}],"c-1":["\n",{"->":"placeHolderForIn"},{"#f":5}],"c-2":["\n",{"->":"youLiftTheLetter"},{"#f":5}]}],{"#f":1}],"toTheRenownedHea":[["^To the renowned Hearth chef The Spiced Hand of Velastra invites you to join our kitchens in Port Velastra, city of a thousand sails. We offer training with master chefs, access to rare spices, and the chance to cook for merchants and dignitaries from every realm. Passage has been secured on a trade ship that leaves within two weeks. Signed, Master Chelio, Spiced Hand representative","\n","ev","str","^Choose Drachenfel and the Jewel of the frontier","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Choose Velastra and the Spiced Hand","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Decide to stay at the Hearth after all","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"inTheEndTheChoic"},{"#f":5}],"c-1":["\n",{"->":"placeHolderForVe"},{"#f":5}],"c-2":["\n",{"->":"areYouSure"},{"#f":5}]}],{"#f":1}],"areYouSure":[["^Are you sure?","\n","ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^No","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"absolutelySure"},{"#f":5}],"c-1":["\n",{"->":"lisaHumsAtTheSto"},{"#f":5}]}],{"#f":1}],"absolutelySure":[["^Absolutely sure?","\n","ev","str","^Defininetly","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Maybe not...","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"youLiveTillYourS"},{"#f":5}],"c-1":["\n",{"->":"lisaHumsAtTheSto"},{"#f":5}]}],{"#f":1}],"youLiveTillYourS":["^You live till your 80s making the tavern a massive success, you have a large family and many apprentices. However, somewhere, deep down, you can't shake off the feeling that you could have done more with your life. The end.","\n","done",{"#f":1}],"placeHolderForIn":["^Lisa stops wiping the counter. The humming stops. She looks at you, her expression softening into that particular look she gives when you’ve scraped your knee or burnt a sauce—patience mixed with a nudge.","\n","^“Hesitation is just fear wearing a sensible coat,” she says, leaning over the wood. “You look at this kitchen and you see a home. I see a cage that is becoming too small for your wings.”","\n","^She reaches out and pokes Inky, who jiggles indignantly. “Even the slime knows it. You stay here, you cook tavern stew forever. You go there, you learn what you are truly made of. Now, stop stalling.”","\n",{"->":"lisaHumsAtTheSto"},{"#f":1}],"youLiftTheLetter":["^You lift the letter stamped with the golden ship wheel. The seal of Velastra catches the lantern light like a small coin.","\n",{"->":"toTheRenownedHea"},{"#f":1}],"placeHolderForVe":["^You imagine the smell of salt and saffron. The Spiced Hand guild is legendary—kitchens where they cook with liquid gold and fire-dancers. It would be a life of wealth, intrigue, and endless summer.","\n","^But as you look at the golden seal, you feel a hollowness. Velastra is a place for chefs who want to be merchants. You look at the Drachenfel letter—the iron-red wax, the promise of a frontier. It feels less like a job offer and more like a challenge.","\n","^Inky seems to agree; she ignores the Velastra letter and headbutts the Drachenfel crest with a soft *thwap*.","\n",{"->":"lisaHumsAtTheSto"},{"#f":1}],"inTheEndTheChoic":["#","^pageNum: 3","/#","^In the end, the choice tastes like iron and rosemary on your tongue. Bold, sharp, a little frightening.","\n",{"->":"iAmGoingToDrache"},{"#f":1}],"iAmGoingToDrache":["^“I am going to Drachenfel,” you say.","\n",{"->":"mariaOpensHerMou"},{"#f":1}],"mariaOpensHerMou":["^Maria opens her mouth to argue, then closes it and throws her arms around you hard enough that Inky squashes and wobbles between you with a muffled squeak.","\n",{"->":"garreckClearsHis"},{"#f":1}],"garreckClearsHis":["^Garreck clears his throat and sets a wrapped bundle on the counter.","\n",{"->":"yourSatchelHeSay"},{"#f":1}],"yourSatchelHeSay":["^“Your satchel,” he says. “I sharpened every blade. Do not let some noble fool tell you how to hold them.”","\n",{"->":"lisaStepsCloserA"},{"#f":1}],"lisaStepsCloserA":["^Lisa steps closer and cups your face in her hands.","\n",{"->":"youWillFeedStran"},{"#f":1}],"youWillFeedStran":["^“You will feed strangers,” she says softly. “Soldiers. Knights. Maybe even that Rosaline herself. Remember this. A meal can be a shield as much as a sword. People tell truth with their plates more than their words.”","\n",{"->":"sheKissesYourFor"},{"#f":1}],"sheKissesYourFor":["^She kisses your forehead and presses a small wooden charm into your palm. It is a tiny carving of Inky, round and silly, with two little dot eyes.","\n",{"->":"bringItBackAndYo"},{"#f":1}],"bringItBackAndYo":["^“Bring it back. And yourself, preferably in one piece.”","\n",{"->":"outsideACaravanW"},{"#f":1}],"outsideACaravanW":["#","^bg_caravan","/#","^Outside, a caravan waits on the road. Drachenfel banners snap in the wind.","\n",{"->":"inkyClimbsToTheT"},{"#f":1}],"inkyClimbsToTheT":["^Inky climbs to the top of your head, puffing herself into a proud little crown.","\n",{"->":"squeee"},{"#f":1}],"squeee":[["^“Squeee.”","\n","ev","str","^Ride with the soldiers and listen to their stories","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Walk beside the wagons and focus on the road and food supplies","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Slip away from the group that evening to cook a farewell meal for yourself and inky","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"placeHolderForGu"},{"#f":5}],"c-1":["\n",{"->":"placeHolderForSc"},{"#f":5}],"c-2":["\n",{"->":"youAndInkyCookAS"},{"#f":5}]}],{"#f":1}],"placeHolderForGu":["^You ride alongside a scarred sergeant named Kael. He eyes Inky with suspicion until the slime mimics his scowl, which startles a laugh out of him.","\n","^“You are the cook, eh?” Kael asks, gnawing on a piece of rock hard dried beef. “Good luck. The Lady Rosaline has a tongue sharper than my sword. She has sent back three chefs this month.”","\n","^He tosses a crust to Inky, who absorbs it with a delighted *shlurp*.","\n","^“One tried to cook fancy Avelorian slop. Too frothy. Another tried to cook Drachenfel spice to impress her. She hated it. Said if she wanted garrison food, she would eat in the mess hall.”","\n","^Kael leans in. “My advice? Don’t try to be clever. Don’t try to be us. Just give us something real. Something that reminds us we are not freezing to death out here.”","\n",{"->":"drachenholdRises"},{"#f":1}],"placeHolderForSc":[["^The road is hard packed earth, but the verge is alive if you know where to look. You walk beside the wagons, scanning the brush. Inky helps, extending a pseudopod to point out patches of wild garlic and frost thyme.","\n","^You find a patch of \"Iron Root\"—ugly, knotted tubers that taste like dirt until you roast them, at which point they turn as sweet as honey. You tuck them into your satchel.","\n","^A group of soldiers is sitting nearby, gnawing on rock hard biscuits and dried beef. They look miserable. You have fresh roots, herbs, and a fire is just starting.","\n","ev","str","^Offer to cook a quick meal for the soldiers with your findings","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Keep the ingredients for later and get back on the road","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"cookingForSoldiers"},{"#f":5}],"c-1":["\n",{"->":"drachenholdRises"},{"#f":5}]}],{"#f":1}],"cookingForSoldiers":["^You borrow a pot and get to work. You roast the Iron Roots until they caramelize, then toss them with the dried beef and water. The frost thyme releases a scent that makes heads turn.","\n","^Within minutes, you are handing out bowls of hot, sweet savory stew. The soldiers eat as if they haven't seen food in weeks.","\n","^\"Blessed Gusto,\" one sighs, scraping his bowl clean. \"Real food. Warm food.\"","\n","^Another soldier, wiping his mouth, nods at you. \"You keep cooking like this, and you might actually survive the Lady. She hates all that fancy, frothy nonsense the capital chefs make. She always says she just wants a meal that 'thaws the bones.'\"","\n","^He winks. \"Remember that. Thaw the bones, don't tickle the tongue.\"","\n","^You pack up your pot, feeling a little wiser.","\n",{"->":"drachenholdRises"},{"#f":1}],"youAndInkyCookAS":[["^You and Inky set up a small fire away from the main wagons. You roast the salted vegetables until they are tender and mix them with the jerky, adding a pinch of wild sage you found earlier. The smell is humble but rich, cutting through the cold evening air.","\n","^Inky bounces happily, imitating your stirring motion with a little slime spoon.","\n","^Nearby, a group of soldiers is chewing on rock hard biscuits. They stop chewing and sniff the air, looking over at your pot with undisguised envy. One of them looks particularly miserable.","\n","ev","str","^Call them over and offer to share the meal","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ignore them and enjoy the quiet meal with Inky","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":"sharedMealWithSoldiers"},{"#f":5}],"c-1":["\n",{"->":"quietMealAlone"},{"#f":5}]}],{"#f":1}],"sharedMealWithSoldiers":["^You wave the soldiers over. They do not need asking twice. Soon, the pot is scraped clean, and Inky is preening under the attention of three burly guards.","\n","^\"Mmm,\" one soldier sighs, wiping his mouth. \"That hit the spot. You have a knack, chef.\"","\n","^He leans in conspiratorially. \"Listen, if you want to survive the Lady, keep cooking like this. She sends back anything too fancy. Says she wants food that 'thaws the bones,' not that frothy nonsense the Avelorian chefs make.\"","\n","^He taps his nose. \"Thaw the bones. Remember that.\"","\n",{"->":"drachenholdRises"},{"#f":1}],"quietMealAlone":["^You decide to keep the meal to yourself. You have a long road ahead, and you need the strength. The soldiers glare at you over their hard biscuits, muttering, but they leave you alone.","\n","^The stew is delicious, and Inky hums with delight as she eats, but the silence feels a little colder than before.","\n",{"->":"drachenholdRises"},{"#f":1}],"drachenholdRises":["#","^bg_castle","/#","^Drachenhold rises from the Dragonspine mountains like a black tooth biting at the clouds. Crimson banners snap over stone walls, each marked with a golden crowned dragon.","\n",{"->":"theWindIsColderH"},{"#f":1}],"theWindIsColderH":["^The wind is colder here. The air smells of iron, smoke, and spiced meat from the great hall.","\n",{"->":"theCaravanWindsT"},{"#f":1}],"theCaravanWindsT":["^The caravan winds through the gate. Guards in crimson cloaks eye you with curiosity as Inky peers back from your shoulder, white eyes wide.","\n",{"->":"nameAndPurposeAG"},{"#f":1}],"nameAndPurposeAG":["^“Name and purpose” a guard demands.","\n",{"->":"youLiftTheSatche"},{"#f":1}],"youLiftTheSatche":["^You lift the satchel slightly.","\n",{"->":"chefYouSayHereAt"},{"#f":1}],"chefYouSayHereAt":["^“Chef,” you say. “Here at the request of Lady Rosaline von Drachenfel.”","\n",{"->":"thatEarnsAFewSur"},{"#f":1}],"thatEarnsAFewSur":["^That earns a few surprised looks.","\n",{"->":"insideTheKeepThe"},{"#f":1}],"insideTheKeepThe":["#","^bg_castledininghall","/#","^Inside the keep, the air is thick with heat, firelight, and the sound of roaring laughter. Knights crowd long tables, pounding cups and tearing into meat. A spicy stew bubbles in enormous cauldrons.","\n",{"->":"inTheMiddleOfThi"},{"#f":1}],"inTheMiddleOfThi":["^In the middle of this storm of steel and noise, Lady Rosaline stands near the high table. Red hair like a living flame, blue eyes sharp and assessing as she notices you.","\n",{"->":"besideHerAStocky"},{"#f":1}],"besideHerAStocky":["^Beside her, a stocky man in spotless whites and a polished copper ladle at his belt watches you with cool appraisal.","\n",{"->":"yourPatronAndThe"},{"#f":1}],"yourPatronAndThe":[["^Your patron. And the head chef you will be irritating simply by existing.","\n","ev","str","^Approach Rosaline first and present yourself with formal courtesy","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Approach the head chef first and show respect for his kitchen","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Take a moment to breathe and observe the hall before speaking","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"youCrossTheHallT"},{"#f":5}],"c-1":["\n",{"->":"foodBattlePlaceH"},{"#f":5}],"c-2":["\n",{"->":"placeHolderForIn1"},{"#f":5}]}],{"#f":1}],"placeHolderForIn1":["^You close your eyes for a second, letting the noise wash over you. It smells different here than the Hearth. There, the air smelled of yeast and timber. Here, it smells of roasting meat, pine resin, and old stone.","\n","^It is aggressive. It is alive.","\n","^Inky tightens her grip on your shoulder, sensing the tension. You take a breath, centering yourself. You are not a knight. You have no armor. But you have your knives, and you know how to feed people who are hungry for more than just food. You open your eyes.","\n",{"->":"youCrossTheHallT"},{"#f":1}],"foodBattlePlaceH":["^You step toward the stocky man in whites. Chef Markus watches you approach, his eyes flicking to the satchel at your hip.","\n","^“The scullery entrance is in the back,” he says, not bothering to look you in the face.","\n","^“I am the one Lady Rosaline sent for,” you reply, keeping your voice steady.","\n","^Markus finally looks at you. He sneers, a precise expression like a cut lemon. “I see. The tavern cook. Do not think that because the Lady has a whim, you are welcome in my kitchen. You stay out of my way, you clean your station, and you do not embarrass this house.”","\n","^Inky blows a raspberry at him. A wet, bubbly sound. Markus’s eye twitches.","\n",{"->":"iAmLadyRosalineV"},{"#f":1}],"youCrossTheHallT":["^You cross the hall to the high table. Knights fall quiet one by one as they notice you approach with Inky peeking from your collar.","\n",{"->":"rosalineTurnsFul"},{"#f":1}],"rosalineTurnsFul":["^Rosaline turns fully toward you. Up close, she is every bit the Jewel of Drachenfel your letters promised. Graceful. Poised. Eyes sharp enough to cut.","\n",{"->":"soSheSaysVoiceCa"},{"#f":1}],"soSheSaysVoiceCa":["^“So,” she says, voice carrying easily over the fading murmurs. “My Hearth chef.”","\n",{"->":"herGazeFlicksToI"},{"#f":1}],"herGazeFlicksToI":["^Her gaze flicks to Inky, who stares back and slowly raises a tiny pseudopod in something that might be a wave.","\n",{"->":"aFewKnightsStifl"},{"#f":1}],"aFewKnightsStifl":["^A few knights stifle laughter. Rosaline’s lips twitch at the corner, just barely.","\n",{"->":"iAmLadyRosalineV"},{"#f":1}],"iAmLadyRosalineV":["^“I am Lady Rosaline von Drachenfel,” she says. “You will cook for me in the field and at my table. I have tasted enough delicate Avelorian food to last a lifetime. I want meals with heart. With strength. With honesty.”","\n",{"->":"herEyesLockOnYou"},{"#f":1}],"herEyesLockOnYou":[["^Her eyes lock on yours.","\n","ev","str","^Promise a fiery dragon pepper stew that matches Drachenfel pride","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Promise a simple Hearth style stew that tastes like home","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Promise a refined dish that blends Drachenfel spice with Avelorian elegance","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"placeHolderForDr"},{"#f":5}],"c-1":["\n",{"->":"youDrawASlowBrea"},{"#f":5}],"c-2":["\n",{"->":"placeHolderForRe"},{"#f":5}]}],{"#f":1}],"placeHolderForDr":["^You grab the heavy iron skillet. If Drachenfel is a land of fire, you decide to speak their language. You chop the root vegetables into large, rustic chunks and sear the meat hard, letting the smoke rise.","\n","^Then, you take a handful of crushed Dragon-peppers—bright red and smelling of heat. You toss them into the fat. The air instantly fills with a spicy, sinus-clearing haze.","\n","^Markus coughs, waving a hand. “Standard garrison fare,” he mutters, looking unimpressed. “Subtle as a hammer.”","\n","^You ignore him. You deglaze with dark ale and let it reduce. The stew is thick, angry, and undeniably Drachenfel.","\n",{"->":"servingTheFieryStew"},{"#f":1}],"servingTheFieryStew":["^In the hall, the scent hits the knights, and they perk up immediately. It smells like the mess hall, but stronger. You set the bowl before Rosaline. It is a deep, menacing red.","\n","^She takes a spoon, tastes it, and pauses. The heat rises, flushing her cheeks, but her expression does not change. She sets the spoon down with a quiet *clink*.","\n","^“It is... accurate,” she says, her voice flat. “It tastes exactly like the stew my garrison cook makes on Tuesdays.”","\n","^She looks up at you, her blue eyes cool. “I brought a chef from the Hearth because I wanted a new story. Instead, you have simply recited one I have heard a thousand times.”","\n","^Markus smirks from the shadows. The knights enjoy the food, but you can feel the opportunity slipping away. You have fed her, but you have not interested her.","\n",{"->":"endOfDemoThanksF"},{"#f":1}],"placeHolderForRe":["^You decide to show them that you are more than a rustic cook. You clarify the broth until it glimmers like amber. You julienne the vegetables into perfect, identical matchsticks. You skim every drop of fat from the surface.","\n","^It looks beautiful. It looks like something served in the high courts of Aveloria. Markus raises an eyebrow, surprised by your technique. \"At least you have some training,\" he mutters.","\n","^Inky looks at the delicate bowl and tilts her head, confused. It lacks the warmth of home.","\n",{"->":"servingTheRefinedStew"},{"#f":1}],"servingTheRefinedStew":["^In the hall, the bowls are set down. They are elegant. The broth is clear, the vegetables floating like jewels. It looks like a painting of a soup rather than a meal.","\n","^Rosaline stares at it. She takes a spoon, sips the broth, and sets the spoon down.","\n","^“It is flawless,” she says. The hall is silent. “It tastes exactly like the soup I was served in the capital last winter. Cold. Technical. Boring.”","\n","^She pushes the bowl away. “I asked for *heart*, chef. Not a performance.”","\n","^Markus nods, his point proven. You have failed to understand your patron. Rosaline sighs. “Eat, knights. At least it is pretty to look at.”","\n",{"->":"endOfDemoThanksF"},{"#f":1}],"youDrawASlowBrea":["^You draw a slow breath.","\n",{"->":"stewYouSayAHeart"},{"#f":1}],"stewYouSayAHeart":["^“Stew,” you say. “A Hearth stew. Nothing clever. Nothing dressed in gold. Meat, roots, broth that has been watched and tasted until it decides it is ready. The sort of food that makes people sit down and stop pretending they are not tired.”","\n",{"->":"theHallReactsBef"},{"#f":1}],"theHallReactsBef":["^The hall reacts before Rosaline does. A few knights chuckle. One scoffs loudly.","\n",{"->":"weRideAndBleedFo"},{"#f":1}],"weRideAndBleedFo":["^“We ride and bleed for Drachenfel and the lady brings a tavern cook” someone mutters.","\n",{"->":"rosalineDoesNotL"},{"#f":1}],"rosalineDoesNotL":["^Rosaline does not look away from you.","\n",{"->":"aSimpleHearthSte"},{"#f":1}],"aSimpleHearthSte":["^“A simple Hearth stew” she repeats. “In Drachenfel. Land of dragon peppers and blood sausage. When my house has spent years trying to prove we are more than rough stone and old stories.”","\n",{"->":"herEyesNarrowJus"},{"#f":1}],"herEyesNarrowJus":["^Her eyes narrow just a fraction. Not angry. Curious.","\n",{"->":"youUnderstandTha"},{"#f":1}],"youUnderstandTha":["^“You understand that you are asking me to trust that simplicity will be enough” she says.","\n",{"->":"inkyPeeksFromYou"},{"#f":1}],"inkyPeeksFromYou":["^Inky peeks from your collar and gives a soft, questioning squeak.","\n",{"->":"youThinkOfLisaAt"},{"#f":1}],"youThinkOfLisaAt":["^You think of Lisa at her pot, saying that a good stew is a spell made slowly instead of with words.","\n",{"->":"yesYouSayIfHeart"},{"#f":1}],"yesYouSayIfHeart":["^“Yes,” you say. “If Hearth food has any power, I will show it to you here.”","\n",{"->":"forAHeartbeatRos"},{"#f":1}],"forAHeartbeatRos":["^For a heartbeat, Rosaline’s face is unreadable.","\n",{"->":"thenSheInclinesH"},{"#f":1}],"thenSheInclinesH":["^Then she inclines her head the smallest amount.","\n",{"->":"veryWellHearthCh"},{"#f":1}],"veryWellHearthCh":["^“Very well, Hearth chef” she says. “You have one meal to prove that your simplicity is not laziness. Go to my kitchens. Show Markus why I asked for a you.”","\n",{"->":"theHeadChefSnort"},{"#f":1}],"theHeadChefSnort":["^The head chef snorts from where he stands.","\n",{"->":"thisWillBeIntere"},{"#f":1}],"thisWillBeIntere":["^“This will be interesting” he says.","\n",{"->":"inkyPuffsUpOnYou"},{"#f":1}],"inkyPuffsUpOnYou":[["^Inky puffs up on your shoulder like a tiny black crown.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"theKitchensOfDra"},{"#f":5}]}],{"#f":1}],"theKitchensOfDra":["#","^bg_kitchen","/#","^The kitchens of Drachenhold roar with sound and heat. Fires crackle in the stone hearths. Pots bubble. Apprentices dart back and forth, arms full of pans and herbs.","\n",{"->":"chefMarkusWaitsN"},{"#f":1}],"chefMarkusWaitsN":["^Chef Markus waits near a cleared station, arms folded. His whites are spotless despite the chaos around him.","\n",{"->":"soHeSaysTheHeart"},{"#f":1}],"soHeSaysTheHeart":["^“So” he says. “The Hearth prodigy. Rosaline’s personal comfort cook.”","\n",{"->":"hisGazeDropsToYo"},{"#f":1}],"hisGazeDropsToYo":["^His gaze drops to your knives and then to Inky, who has claimed the top of your head like an uncertain hat.","\n",{"->":"youPromisedTheLa"},{"#f":1}],"youPromisedTheLa":["^“You promised the lady a simple Hearth stew as your first dish in Drachenfel. No dragon roast. No tower of sugar and spice. A stew.”","\n",{"->":"heGesturesAtTheW"},{"#f":1}],"heGesturesAtTheW":["^He gestures at the waiting ingredients. Bones. Root vegetables. Onions. A small basket of herbs that smell like the Hearth if you close your eyes.","\n",{"->":"aStewCanBeGenius"},{"#f":1}],"aStewCanBeGenius":["^“A stew can be genius or it can be water with ideas” Markus says. “You have one cauldron, one fire, and a short window before the lady grows impatient. Show me which kind you make.”","\n",{"->":"youFeelLisasOldW"},{"#f":1}],"youFeelLisasOldW":["^You feel Lisa’s old wooden spoon in your memory. Garreck’s heavy hand on your shoulder. Maria laughing as she stole tastes from the pot. The Hearth was never about cleverness. It was about care.","\n",{"->":"inkyLeansDownAnd"},{"#f":1}],"inkyLeansDownAnd":["^Inky leans down and taps your cheek with a tiny pseudopod.","\n",{"->":"squeee1"},{"#f":1}],"squeee1":["^“Squeee.”","\n",{"->":"youTakeYourFirst"},{"#f":1}],"youTakeYourFirst":[["^You take your first step toward the cauldron.","\n","ev","str","^Focus on flawless knife work and timing to showcase perfect technique","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Focus on slow layered flavors and small comforts that echo the Hearth","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Start with Hearth basics, then add a quiet twist that Drachenfel has never tasted","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"youLetYourHandsF"},{"#f":5}],"c-1":["\n",{"->":"youBuildTheStewT"},{"#f":5}],"c-2":["\n",{"->":"youBeginWithHear"},{"#f":5}]}],{"#f":1}],"youLetYourHandsF":["^You let your hands fall into familiar patterns. Bones are blanched and roasted to deepen their flavor. Aromatics sweat in fat until they glisten. Vegetables are cut into even pieces that will soften in perfect unison.","\n",{"->":"theKitchenStaffW"},{"#f":1}],"theKitchenStaffW":["^The kitchen staff watches in a growing hush. Even Markus’s eyes sharpen as you move from pot to board and back again with measured economy.","\n",{"->":"steamFillsTheAir"},{"#f":1}],"steamFillsTheAir":["^Steam fills the air, heavy with scent. When you taste the broth, it is clear and deep, every note in its place.","\n",{"->":"laterInTheHallBo"},{"#f":1}],"laterInTheHallBo":["^Later, in the hall, bowls of your stew are set before Rosaline and the knights. Inky peers over the edge of your own bowl and breathes in with a pleased trill.","\n",{"->":"rosalineTakesThe"},{"#f":1}],"rosalineTakesThe":["^Rosaline takes the first spoonful. She closes her eyes for a moment. When she opens them, you see thought there, nothing more.","\n",{"->":"thisIsVeryWellMa"},{"#f":1}],"thisIsVeryWellMa":["^“This is very well made” she says. “Balanced. Honest. Exactly what you promised.”","\n",{"->":"herWordsAreCorre"},{"#f":1}],"herWordsAreCorre":["^Her words are correct and cool. The kind of compliment she might offer to a map that is accurate but uninspiring.","\n",{"->":"aroundHerTheKnig"},{"#f":1}],"aroundHerTheKnig":["^Around her, the knights eat without complaint. One even asks for a second bowl. Markus, standing near the wall, gives you a single firm nod.","\n",{"->":"inMyKitchenYourH"},{"#f":1}],"inMyKitchenYourH":["^“In my kitchen, your hands will be useful” he says quietly when you pass him.","\n",{"->":"usefulNotYetRema"},{"#f":1}],"usefulNotYetRema":["^Useful. Not yet remarkable.","\n",{"->":"rosalinesGazeFin"},{"#f":1}],"rosalinesGazeFin":["^Rosaline’s gaze finds you once more.","\n",{"->":"nextTimeSheSaysS"},{"#f":1}],"nextTimeSheSaysS":["^“Next time” she says, “show me something that only you can cook, Hearth chef.”","\n",{"->":"inkyNudgesYourCh"},{"#f":1}],"inkyNudgesYourCh":[["^Inky nudges your chin, a tiny question. You feel the edge of opportunity and the hint that you did not quite reach it.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"endOfDemoThanksF"},{"#f":5}]}],{"#f":1}],"youBuildTheStewT":["^You build the stew the way Lisa taught you when the snow came early and customers arrived with tired eyes and empty purses.","\n",{"->":"youRoastTheBones"},{"#f":1}],"youRoastTheBones":["^You roast the bones for depth, yes, but you also scrape every browned bit from the pan. You toast the herbs just enough to wake them. You add a ladle of the stew back into itself midway through, letting old flavor teach new broth what it should become.","\n",{"->":"youTalkToTheAppr"},{"#f":1}],"youTalkToTheAppr":["^You talk to the apprentices, give them small tasks, let their hands be part of the work. Laughter begins to follow you from station to station.","\n",{"->":"byTheTimeYouCarr"},{"#f":1}],"byTheTimeYouCarr":["^By the time you carry the cauldron to the service line, the kitchen smells like home so strongly that Inky curls around your neck and practically purrs.","\n",{"->":"inTheHallSoldier"},{"#f":1}],"inTheHallSoldier":["#","^bg_castledininghall","/#","^In the hall, soldiers bend over their bowls and fall quiet after the first taste. Someone laughs in disbelief. Someone else swears they have not eaten anything this good since they were a child.","\n",{"->":"rosalineEatsMore"},{"#f":1}],"rosalineEatsMore":["^Rosaline eats more slowly. She listens to the way the hall changes around her.","\n",{"->":"thisIsComfortInA"},{"#f":1}],"thisIsComfortInA":["^“This is comfort in a bowl” she says at last. “You have fed them well.”","\n",{"->":"herSpoonRestsInT"},{"#f":1}],"herSpoonRestsInT":["^Her spoon rests in the empty bowl. Her eyes are thoughtful, but her expression stays distant.","\n",{"->":"forMyPeopleThisI"},{"#f":1}],"forMyPeopleThisI":["^“For my people, this is a gift” she continues. “For me, it is a memory of a home that was never mine. I asked for a dish to prove you belong in Drachenfel.”","\n",{"->":"sheDipsHerHeadIn"},{"#f":1}],"sheDipsHerHeadIn":["^She dips her head in a small, polite nod.","\n",{"->":"youBelongAtTable"},{"#f":1}],"youBelongAtTable":["^“You belong at tables like this” she says. “But next time, show me how you will change this place, not just soothe it.”","\n",{"->":"theKnightsAreAlr"},{"#f":1}],"theKnightsAreAlr":["^The knights are already asking when you will cook again. Markus watches you with a grudging respect that was not there before.","\n",{"->":"butRosalinesAppr"},{"#f":1}],"butRosalinesAppr":["^But Rosaline’s approval, the approval that truly matters for your path, still feels an arm length away.","\n",{"->":"inkyBumpsYourChe"},{"#f":1}],"inkyBumpsYourChe":[["^Inky bumps your cheek with a small, questioning squeak.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"endOfDemoThanksF"},{"#f":5}]}],{"#f":1}],"youBeginWithHear":["^You begin with Hearth rules. Bones roasted until they crackle. Onions and garlic turned sweet and golden. Root vegetables cut by feel, not by measure, so that each spoonful will be a little different.","\n",{"->":"theKitchenSettle"},{"#f":1}],"theKitchenSettle":["^The kitchen settles into that rhythm with you. Apprentices relax as they follow your instructions. Markus watches without comment, eyes narrowed, waiting to see if you are only copying old tricks.","\n",{"->":"thenYouReachForS"},{"#f":1}],"thenYouReachForS":["^Then you reach for something that is not from the Hearth at all.","\n",{"->":"aSmallPouchOfSmo"},{"#f":1}],"aSmallPouchOfSmo":["^A small pouch of smoked dragon pepper flakes. A jar of preserved mountain herbs that taste like frost and clean stone. A ladle of thick, dark stock that Drachenfel keeps for its own blood rich stews.","\n",{"->":"youAddTheDragonP"},{"#f":1}],"youAddTheDragonP":["^You add the dragon pepper in a careful handful, not enough to burn, just enough to leave a glow that builds at the back of the tongue. You tie the mountain herbs into a bundle and let them steep near the surface, so the scent of the brew is Drachenfel even while the base is Hearth.","\n",{"->":"whenYouTasteTheB"},{"#f":1}],"whenYouTasteTheB":["^When you taste the broth, it tastes like you stayed and left at the same time.","\n",{"->":"inkyTastesADropF"},{"#f":1}],"inkyTastesADropF":["^Inky tastes a drop from your fingertip and shivers with delight.","\n",{"->":"squeee2"},{"#f":1}],"squeee2":["^“Squeee.”","\n",{"->":"inTheHallTheFirs"},{"#f":1}],"inTheHallTheFirs":["#","^bg_castledininghall","/#","^In the hall, the first spoonful hits like a story told in two accents at once. Familiar comfort. Then a slow rising heat that feels like standing too close to a watch fire on a cold night in the mountains.","\n",{"->":"theKnightsReactF"},{"#f":1}],"theKnightsReactF":["^The knights react first. One laughs out loud. Another slams their hand on the table.","\n",{"->":"thisIsOursSomeon"},{"#f":1}],"thisIsOursSomeon":["^“This is ours” someone says. “Hearth or not, this is Drachenfel stew now.”","\n",{"->":"rosalineEatsInSi"},{"#f":1}],"rosalineEatsInSi":["^Rosaline eats in silence until her bowl is nearly empty. Her cheeks are touched with a faint heat that is not quite from the pepper.","\n",{"->":"thisSheSaysSoftl"},{"#f":1}],"thisSheSaysSoftl":["^“This” she says softly, more to herself than to anyone else, “feels like home I never had and home I chose.”","\n",{"->":"sheLooksAtYouAnd"},{"#f":1}],"sheLooksAtYouAnd":["^She looks at you and for the first time you feel her attention settle on you like a cloak.","\n",{"->":"youTookSimplicit"},{"#f":1}],"youTookSimplicit":["^“You took simplicity and had the nerve to change it” she says. “You respected where you came from and still made something for where you stand.”","\n",{"->":"herSmileIsSmallB"},{"#f":1}],"herSmileIsSmallB":["^Her smile is small but real.","\n",{"->":"iDidNotWasteMyTi"},{"#f":1}],"iDidNotWasteMyTi":["^“I did not waste my time” she decides. “From now on, when I introduce you, I will not call you tavern cook. I will call you my chef.”","\n",{"->":"behindHerMarkusE"},{"#f":1}],"behindHerMarkusE":["^Behind her, Markus exhales slowly, a sound that is almost a laugh.","\n",{"->":"rememberThisDish"},{"#f":1}],"rememberThisDish":["^“Remember this dish” he murmurs when you pass him. “This is your standard now.”","\n",{"->":"inkySwellsOnYour"},{"#f":1}],"inkySwellsOnYour":[["^Inky swells on your shoulder, proud and bright eyed.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"endOfDemoThanksF"},{"#f":5}]}],{"#f":1}],"endOfDemoThanksF":["^End of demo, thanks for reading!","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}